what is TypeScript?
 타입스크립트는 자바스크립트의 슈퍼셋이다. 
 그말인 즉슨 타입스크립트는 새로운 언어가 아닌 자바스크립트로 빌드업을 하는 언어이다.
 
 자바스크립트의 상휘호환이라고 보면 쉽다, js에는 없는 새로운 기능이 추가된 버전인셈이다.
 그러나 타입스크립트는 브라우저에서 실행이 안된다, 브라우저는 js를 실행 시킬줄 알지만 ts는 실행시키지 못하기 때문이다.

 그래서 우리가 타입스크립트를 작성하면 노말 js로 콤파일이 되는형식으로 우리는 쓴다. 
 
 타입스크립트는 타입을 추가한다. 코드를 실행시키지 않아도 에러를 일찍 알수있게 해주는 고마운 기능이다.

 타입스크립트를 사용해야하는 예시,
 가령 이런 함수가 있다고 생각해보자,

 function add(num1, num2) {
     return num1 + num2;
 }

 console.log(add('2','3'))

 우리가 원하는건 2+3, 즉 5 이지만 우리가 실수로 인풋을 string으로 넣었기 때문에 
 자바스크립트는 23으로 리턴해준다. 이런 에러를 코드를 짜는 동안 방지하는게 타입스크립트이다.

 타입스크립트는 타입을 추가하고, 앞으로 나올 자바스크립트의 기능들을 사용할수있으며 오래된 브라우저에도 적용이 된다,
 또한 자바스크립트에는 없는 Interface나 Generics 같은 추가 기능역시 사용 가능해진다. 마지막으로 Meta-programming Feature (Decorator) 같은것도 지원한다.